[
    {
        "title": "Rigatoni with Easy Vodka Sauce",
        "description": "Before you convince yourself there's no way that a little onion, tomato paste, and half-and-half can come together in mere minutes to make one of the best homemade pasta sauces you've ever had, hear us out. Better yet, make this recipe for yourself. Just try and use double-concentrated tomato paste, which packs more flavor than the standard stuff.",
        "instructions": "Fill a stock pot or other large pot three-quarters full with water and heat over high. Toss in a handful of salt and bring to a boil while you do your other prep. Peel and finely chop 1 onion. Firmly smash 4 garlic cloves with the flat side of a chef’s knife and remove peel. Grate 4 oz. Parmesan on the smallest holes of the box grater. Heat 2 Tbsp. oil in a Dutch oven over medium (position it next to pot of water). Add onion and garlic and cook, stirring constantly, just until onion is starting to brown around the edges, 5–7 minutes. Add entire 4.5-oz. tube tomato paste and ½ tsp. red pepper flakes and stir until paste evenly coats onion. Continue to cook, stirring often, until paste is deep red and starting to brown on bottom of pot, 5–7 minutes. Add 2 oz. vodka to deglaze pan and stir to incorporate, scraping bottom of pot. Reduce heat to low. Using a heatproof glass measuring cup, scoop about ¼ cup boiling water from pot, then add ¾ cup half-and-half to measuring cup (this brings up the temperature of the half-and-half so it won’t break when you add it to the pot). Slowly add warmed half-and-half to Dutch oven, stirring constantly, until a smooth sauce forms. Remove from heat. Add 1 lb. rigatoni to pot of boiling salted water and cook according to package instructions until al dente. About 1 minute before the timer goes off, use heatproof measuring cup to scoop up about 1 cup pasta cooking liquid. Heat Dutch oven over low. Using a spider, transfer rigatoni to Dutch oven along with any water that’s piggybacking on the pasta. Add ½ cup pasta cooking liquid to Dutch oven and stir to incorporate, then gradually add half of Parmesan, stirring constantly to melt cheese. You should have a smooth, glossy sauce that coats each piece of pasta. Season with salt and add a splash more pasta cooking liquid to thin sauce, if needed. Divide pasta among bowls. Top with remaining cheese, dividing evenly. Drizzle with more oil, then tear basil leaves over.",
        "ingredients": "Koshers salt, onion, garlic, parmesan cheese, EVOO, tomato paste, crushed red pepper falkes, vodka, half and half, rigatoni, basil"
    },
    {
        "title": "No-Fail Roast Chicken with Lemon and Garlic",
        "description": "This recipe eliminates one of the most common complaints about whole roast chickens—that it’s hard to know when they’re cooked all the way through. We’ve made it easier to check for doneness with lots of visual cues that anyone can follow, but if you have an instant-read thermometer, go ahead and use it. Remove chicken from the oven when thickest part of thigh hits 160°, and carryover cooking will bring it up to 165°",
        "instructions": "Arrange a rack in center of oven; preheat to 425°. Cut 1 lemon in half crosswise and remove any visible seeds. Cut 1 head of garlic in half crosswise. Melt ½ stick butter in a small saucepan or microwave in a small bowl. Place 1 3–4-lb. whole chicken on a cutting board (best to use a plastic one you can sterilize) and pat dry with paper towels. With chicken breast facing up and legs pointing toward you, use a sharp knife to slice through loose area of skin draped between leg and breast, making about a 3inch long incision. Continue cutting downward until you hit the joint that connects the thigh to the body, then stop (once you get through the skin, there’s not much there; if you are cutting through flesh, you’re too close to the breast). This exposes the leg joint, making it easy to tell if chicken is cooked. Repeat on second side. Season every surface of chicken, including skin along backbone, inside cavity, under wings, and inside part of the leg you just exposed, with lots of salt and pepper. If you’re using kosher salt, it should take you 4–5 generous pinches. Transfer chicken breast side up to a large skillet. Arrange lemon and garlic cut sides down in skillet around chicken. Drizzle chicken all over with melted butter and transfer to oven. Roast until chicken is nicely browned and cooked through, checking for doneness after 45 minutes. To check, carefully remove skillet from oven (the handle is hot!), poke a knife into leg joints, and pierce the meat. If juices run clear, chicken is done. If you see a rosy pink color, it needs more time. Continue to roast, checking every 5 minutes, until juices run clear. (If you’re not sure, you can also use the knife to lightly shred some of the meat along the thigh bone—the meat should look opaque and the fibers should separate easily.) Let chicken rest in skillet at least 15 minutes before carving. Transfer chicken to a platter. Top with pan juices and serve with roasted lemon and garlic alongside. ",
        "ingredients": "Lemon, garlic, butter, EVOO, chicken, kosher salt, black pepper"
    },
    {
        "title": "Chocolate Nutella Pudding",
        "description": "While nothing beats the ultra-silky, ultra-smooth texture of classic Nutella, you can use any brand of chocolate hazelnut spread you like for this pudding recipe.",
        "instructions": "Chop 4 oz. chocolate; set aside. Whisk ¼ cup cornstarch, ¼ cup sugar, ¼ cup cocoa powder, and 1 tsp. kosher salt in a medium saucepan. Very slowly stream in 3 cups milk, whisking constantly, until lump-free. Cook over medium heat, whisking constantly and vigorously, until pudding is bubbling and thick enough that wires of whisk leave a trail, 7–10 minutes. Remove from heat. Whisk in one-quarter of the chopped chocolate until smooth. Add remaining chocolate in three additions, whisking after each addition, until chocolate is melted and mixture is smooth. Whisk in 1 tsp. vanilla. Place 1 cup Nutella in a medium bowl and add about ½ cup warm pudding mixture. Whisk until smooth, then whisk in remaining pudding mixture until incorporated. Cover pudding with plastic, pressing directly onto surface to prevent a skin from forming. You can let it cool slightly at this point and serve warm, or chill pudding until completely set, at least 2 hours. Meanwhile, crush ½ cup hazelnuts with the bottom of a small saucepan to break into irregular bits. Cook hazelnuts and 2 Tbsp. butter in saucepan over medium heat, stirring often, until butter is browned and hazelnuts are golden, 8–10 minutes. Let cool.If serving pudding warm, divide among bowls or ramekins. (Or, you know, feel free to eat it right out of the pot.) If pudding is chilled, transfer to a large bowl and whisk until smooth before serving. Top with hazelnuts and a sprinkle of sea salt.",
        "ingredients": "Bittersweet chocolate, cornstarch, sugar, cocoa power, kosher salt, whole milk, vanilla extract, nutella, hazelnuts, butter, salt"
    }
]